---
title: SiteImportFailures
classe: Autodesk.Revit.DB.BuiltInFailures+SiteImportFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# SiteImportFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId BoundaryDetectError { get; }` | `SiteImportFailures.BoundaryDetectError` | FailureDefinitionId |
| `FailureDefinitionId ContoursNoncontours { get; }` | `SiteImportFailures.ContoursNoncontours` | FailureDefinitionId |
| `FailureDefinitionId DifferentEntityTypes { get; }` | `SiteImportFailures.DifferentEntityTypes` | FailureDefinitionId |
| `FailureDefinitionId InvalidBoundaryError { get; }` | `SiteImportFailures.InvalidBoundaryError` | FailureDefinitionId |
| `FailureDefinitionId NoPoints { get; }` | `SiteImportFailures.NoPoints` | FailureDefinitionId |
| `FailureDefinitionId NoViewSpecificSiteImports { get; }` | `SiteImportFailures.NoViewSpecificSiteImports` | FailureDefinitionId |
| `FailureDefinitionId SurfaceExists { get; }` | `SiteImportFailures.SurfaceExists` | FailureDefinitionId |
| `FailureDefinitionId TooFarAway { get; }` | `SiteImportFailures.TooFarAway` | FailureDefinitionId |
| `FailureDefinitionId TooFewPoints { get; }` | `SiteImportFailures.TooFewPoints` | FailureDefinitionId |
| `FailureDefinitionId TooLarge { get; }` | `SiteImportFailures.TooLarge` | FailureDefinitionId |
| `FailureDefinitionId TooManyMeshes { get; }` | `SiteImportFailures.TooManyMeshes` | FailureDefinitionId |
| `FailureDefinitionId UnusedPoints { get; }` | `SiteImportFailures.UnusedPoints` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```